InformationRegisters/КанбанРазделители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанРазделители</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИДКарточка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанДоски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанДоски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разделитель</Name>
					<Comment>0 без разделителей, 1 Проект, 2 Сотрудник</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяКартинкиКорзины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанДорожки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанДорожки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитКарточек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Общая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанКолонки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанКолонки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеПриПопадании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещенИнтерактивныйПереход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещенИнтерактивныйУход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитКарточек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяКомментарий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанКарточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанКарточки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Comment>ПустаяСтрока по умолчанию</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанПереходКарточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанПереходКарточки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерВКолонке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДКудаДорожка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДКудаКолонка</Name>
					<Comment>"1"  выполнена. "100"  корзина "200" приостановлена.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДПерехода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИДКарточка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанДополнительныеДанныеПерехода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанДополнительныеДанныеПерехода</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дополнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИДПерехода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДополнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омКанбанНачальноеЗаполнение/Ext/Module.bsl
Процедура ЗаполнитьНачальноеЗаполнениеКанбана(ИмяКанбана, стРазделители, мРесурсы, Комментарий) Экспорт

	стПараметры = ПолучитьДанныеДоски(ИмяКанбана); //ДоскаУИД, КанбанДорожкиУИД, КанбанКолонкиУИД, Разделители
	
	Сотрудник 	= Неопределено;
	Проект		= Неопределено;
	
	Если стПараметры.Разделители.Сотрудник Тогда
		стРазделители.Свойство("Сотрудник", Сотрудник);
	КонецЕсли;
	
	Если стПараметры.Разделители.Проект Тогда
		стРазделители.Свойство("Проект", Проект);
	КонецЕсли; 
	
	ТребуетсяРазделитель = НЕ(Сотрудник = Неопределено И Проект = Неопределено);
	
	ТД = ТекущаяДата();
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	стПараметрыКарточки 			= ПолучитьСтруктуруДляЭлементовКанбана("Карточка");
	
	стПараметрыПерехода 			= ПолучитьСтруктуруДляЭлементовКанбана("ПереходКарточки", Комментарий);
	
	стПараметрыДополнительныеДанные = ПолучитьСтруктуруДляЭлементовКанбана("ДополнительныеДанные");
	стПараметрыДополнительныеДанные.ТипДополнения 	= "Новая";
	стПараметрыДополнительныеДанные.Дополнение 		= Истина;
	
	стПараметрыКарточки.Доска 			= стПараметры.ДоскаУИД;
	стПараметрыПерехода.Доска 			= стПараметры.ДоскаУИД;
	стПараметрыПерехода.УИДКудаКолонка 	= стПараметры.КанбанКолонкиУИД;
	стПараметрыПерехода.УИДКудаДорожка 	= стПараметры.КанбанДорожкиУИД;
	
	Для каждого текущийРесурс Из мРесурсы Цикл
		
		стПараметрыКарточки.Наименование 	= текущийРесурс.Наименование;
		стПараметрыКарточки.Ресурс 			= текущийРесурс.Ссылка;
		УИДКарточка 						= СоздатьКарточкиКанбан(стПараметрыКарточки);
	
		стПараметрыПерехода.УИДКарточка 	= УИДКарточка;
		
		УИДПерехода = СоздатьДвижениеКарточки(стПараметрыПерехода); 
		
		стПараметрыПерехода.НомерВКолонке 	= стПараметрыПерехода.НомерВКолонке + 1;
		
		
		стПараметрыДополнительныеДанные.УИДПерехода = УИДПерехода;
		СоздатьДополнениеКДвижению(стПараметрыДополнительныеДанные);
		
		Если ТребуетсяРазделитель Тогда
			
			МенеджерКанбанРазделители = РегистрыСведений.КанбанРазделители.СоздатьМенеджерЗаписи();
			МенеджерКанбанРазделители.УИДКарточка 	= УИДКарточка;
			МенеджерКанбанРазделители.Проект 		= Проект;
			МенеджерКанбанРазделители.Сотрудник 	= Сотрудник;
			
			МенеджерКанбанРазделители.Записать();
			
		КонецЕсли;

	КонецЦикла;
	

КонецПроцедуры 

Функция ПолучитьРазделитилиИзКода(Код) Экспорт

 	Разделители = Новый Структура("Проект, Сотрудник", Ложь, Ложь);
	
	ДвоичныйКод = ИзДесятичногоВСтроковуюДвоичную(Код);
	
	ДлинаКода = СтрДлина(ДвоичныйКод);
	
	Если Сред(ДвоичныйКод,ДлинаКода, 1) = "1" Тогда
	
		Разделители.Проект = Истина;	
	
	КонецЕсли;
	
	Если Сред(ДвоичныйКод,ДлинаКода - 1, 1) = "1" Тогда
	
		Разделители.Сотрудник = Истина;	
	
	КонецЕсли;
	
	Возврат Разделители;
	

КонецФункции // ПолучитьРазделитилиИзКода()

Функция ИзДесятичногоВСтроковуюДвоичную(Знач ДесятичноеЧисло)
	
	стрВозврата = "";
	
	Пока ДесятичноеЧисло > 0 Цикл
	
		стрВозврата = Строка(ДесятичноеЧисло % 2) + стрВозврата;		
		ДесятичноеЧисло = Цел(ДесятичноеЧисло / 2)
	
	КонецЦикла;
	
	Возврат стрВозврата;

КонецФункции // ИзДесятичногоВСтроковуюДвоичную()

Функция ПолучитьДанныеДоски(ИмяКанбана)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанДоски.УИД КАК УИД,
		|	КанбанДоски.Разделитель КАК Разделитель
		|ПОМЕСТИТЬ втДоска
		|ИЗ
		|	РегистрСведений.КанбанДоски КАК КанбанДоски
		|ГДЕ
		|	КанбанДоски.Наименование = &Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КанбанДорожки.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.КанбанДорожки КАК КанбанДорожки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДоска КАК втДоска
		|		ПО КанбанДорожки.Доска = втДоска.УИД
		|ГДЕ
		|	КанбанДорожки.НомерПоПорядку = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КанбанКолонки.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДоска КАК втДоска
		|		ПО КанбанКолонки.Доска = втДоска.УИД
		|ГДЕ
		|	КанбанКолонки.НомерПоПорядку = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДоска.УИД КАК УИД,
		|	втДоска.Разделитель КАК Разделитель
		|ИЗ
		|	втДоска КАК втДоска";
	
	Запрос.УстановитьПараметр("Наименование", ИмяКанбана);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	стПараметры = Новый Структура("ДоскаУИД, КанбанДорожкиУИД, КанбанКолонкиУИД, Разделители", );
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		стПараметры.КанбанДорожкиУИД = Выборка.УИД;
	КонецЦикла;

	Выборка = РезультатЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		стПараметры.КанбанКолонкиУИД = Выборка.УИД;
	КонецЦикла; 
	
	Выборка = РезультатЗапроса[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		стПараметры.ДоскаУИД 	= Выборка.УИД;
		стПараметры.Разделители = ПолучитьРазделитилиИзКода(Выборка.Разделитель);
	КонецЦикла; 
	
	Возврат стПараметры;	
	
КонецФункции // ПолучитьДанныеДоски()

Функция СоздатьКарточкиКанбан(стПараметры) Экспорт
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КанбанКарточки.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|ГДЕ
		|	КанбанКарточки.Доска = &ДоскаУИД
		|	И КанбанКарточки.Ресурс = &Ресурс";
	
	Запрос.УстановитьПараметр("ДоскаУИД",	стПараметры.Доска);
	Запрос.УстановитьПараметр("Ресурс",	стПараметры.Ресурс);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.УИД;
	КонецЦикла;
	
	
	МенеджерЗаписи = РегистрыСведений.КанбанКарточки.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, стПараметры); 
	МенеджерЗаписи.УИД = Строка(Новый УникальныйИдентификатор());
	
	МенеджерЗаписи.Записать();
	
	Возврат МенеджерЗаписи.УИД;
	
КонецФункции

Функция ПолучитьСтруктуруДляЭлементовКанбана(ТипЭлемента, Комментарий = "") Экспорт

    стПараметры = Новый Структура();

	Если ТипЭлемента = "Карточка" Тогда
		
		стПараметры.Вставить("Доска", 			"");
		стПараметры.Вставить("Комментарий", 	Комментарий);
		стПараметры.Вставить("Наименование", 	"");
		стПараметры.Вставить("Окончание", 		Ложь);
		стПараметры.Вставить("Ресурс", 			Неопределено);
		стПараметры.Вставить("Цвет", 			"");
		стПараметры.Вставить("УИДКарточка",		Новый УникальныйИдентификатор());
		
	ИначеЕсли ТипЭлемента = "ПереходКарточки" Тогда
		
		стПараметры.Вставить("Доска", 			"");
		стПараметры.Вставить("УИДКарточка", 	"");
		стПараметры.Вставить("НомерВКолонке",	0);
		стПараметры.Вставить("Комментарий", 	Комментарий);
		стПараметры.Вставить("Наименование", 	"");
		стПараметры.Вставить("Окончание", 		Ложь);
		стПараметры.Вставить("Пользователь", 	ПараметрыСеанса.ТекущийПользователь);
		стПараметры.Вставить("УИДКудаДорожка",	"");
		стПараметры.Вставить("УИДКудаКолонка",	"");
		стПараметры.Вставить("Период",			ТекущаяДата());
		стПараметры.Вставить("УИДПерехода",		Новый УникальныйИдентификатор());
		
	ИначеЕсли ТипЭлемента = "ДополнительныеДанные" Тогда

		стПараметры.Вставить("УИДПерехода",		"");
		стПараметры.Вставить("ТипДополнения", 	"");
		стПараметры.Вставить("Дополнение", 		Комментарий);

	КонецЕсли;
	
	
	Возврат стПараметры;
	
КонецФункции // ПолучитьСтруктуруДляСозданияКарточки()
 
Функция СоздатьДвижениеКарточки(стПараметры) Экспорт

	Если стПараметры.НомерВКолонке = -1 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСТЬNULL(МАКСИМУМ(КанбанПереходКарточкиСрезПоследних.НомерВКолонке), 0) + 1 КАК НомерВКолонке
			|ИЗ
			|	РегистрСведений.КанбанПереходКарточки.СрезПоследних(, ) КАК КанбанПереходКарточкиСрезПоследних
			|ГДЕ
			|	КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = &УИДКудаКолонка";
		
		Запрос.УстановитьПараметр("УИДКудаКолонка", стПараметры.УИДКудаКолонка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			стПараметры.НомерВКолонке = Выборка.НомерВКолонке;
		КонецЦикла;
		
	КонецЕсли;
	
	
	МенеджерЗаписи = РегистрыСведений.КанбанПереходКарточки.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, стПараметры);
	
	МенеджерЗаписи.Записать();
	
	Если НЕ ПустаяСтрока(стПараметры.Комментарий) Тогда
		
		стПараметрыДополнительныеДанные 				= ПолучитьСтруктуруДляЭлементовКанбана("ДополнительныеДанные", стПараметры.Комментарий);
		стПараметрыДополнительныеДанные.ТипДополнения 	= "Комментарий";
		
		стПараметрыДополнительныеДанные.УИДПерехода = МенеджерЗаписи.УИДПерехода;
		СоздатьДополнениеКДвижению(стПараметрыДополнительныеДанные);
		
	КонецЕсли;
	
	омКанбанДоскиНаСервере.ИнкриментВерсии(стПараметры.Доска);

	Возврат МенеджерЗаписи.УИДПерехода;
	
КонецФункции // СоздатьДвижениеКарточки()

Процедура СоздатьДополнениеКДвижению(стПараметры) Экспорт

	МенеджерЗаписи = РегистрыСведений.КанбанДополнительныеДанныеПерехода.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, стПараметры);
	
	МенеджерЗаписи.Записать();

КонецПроцедуры
